# Практическая работа 2
## Логические выражения, таблицы истинности и логические схемы

а) [Лабораторная работа №3. Логические основы работы компьютера. Логические функции. Таблицы истинности. Упрощение логических функций. Стр. 38-45](https://xn--80aqa2d.xn--p1ai/files/e27dcce4-d929-464f-b8b8-2b4b59d36bfc.pdf)

б) Вывод в консоль результатов вычисления логических выражений в C++

```c++
#include <iostream>

using namespace std;

int main()
{
    bool A = true;
    bool B = true;
    bool C = false;
    
    bool result1 = (A xor B) and not C;
    cout << result1 << endl;
    
    bool result2 = (A ^ B) && !C;
    cout << result2 << endl;

    return 0;
}
```

в) Построение таблицы истинности для функции xor ("исключающее ИЛИ")
```C++
/*
output:
A B res = A xor B
0 0 0
0 1 1
1 0 1
1 1 0
*/

#include <iostream>

using namespace std;

int main()
{
    bool A, B, res;
    
    cout << "A " << "B " << "res = A xor B" << endl;
    
    A = 0, B = 0;
    res = A xor B;
    cout << A << " " << B << " " << res << endl;
    
    A = 0, B = 1;
    res = A xor B;
    cout << A << " " << B << " " << res << endl;
    
    A = 1, B = 0;
    res = A xor B;
    cout << A << " " << B << " " << res << endl;
    
    A = 1, B = 1;
    res = A xor B;
    cout << A << " " << B << " " << res << endl;

    return 0;
}
```

г) Написать программу, меняющую значения двух целочисленных переменных без использования вспомогательной переменной
```c++
/*
a = 8     = 0b00001000
b = 16    = 0b00010000
a = a ^ b = 0b00011000
b = b ^ a = 0b00001000
a = a ^ b = 0b00010000

output:
a=8 b=16
a=16 b=8
*/

#include <iostream>

using namespace std;

int main()
{
    int a = 8, b = 16;
    cout << "a=" << a << " b=" << b << endl;
    
    a = a ^ b;
    b = b ^ a;
    a = a ^ b;
    
    cout << "a=" << a << " b=" << b << endl;

    return 0;
}
```

д) [Лабораторная работа №4. Логические основы работы компьютера. Логические функции. Основные логические элементы. Логические схемы. Стр. 46-57](https://xn--80aqa2d.xn--p1ai/files/e27dcce4-d929-464f-b8b8-2b4b59d36bfc.pdf)
