# Динамические массивы

Написать программу, создающую динамический массив из 10 элементов. Инициализировать массив случайными числами в диапазоне от 1 до 10. Вывести содержимое массива в консоль с округлением до сотых.

```c++
#include <iostream>
// <ctime> содержит прототип функции time()
#include <ctime>
// <iomanip> содержит прототип функции setprecision()
#include <iomanip>

using namespace std;

int main()
{
    // 1. Переменная N содержит размер массива
    int N = 10;
    
    // 2 Инициализируем генератор случайных чисел
    srand(time(0));
    
    // 3. Создаём одномерный динамический массив из N элементов типа double
    //    и сохраняем указатель на него в переменной ptrArray типа double*
    double *ptrArray = new double [N];
    
    // 4. Заполняем массив случайными числами в диапазоне от 1 до 10
    for(int i = 0; i<N; i++)
    {
        ptrArray[i] = (rand() % 10 + 1) / float((rand() % 10 + 1));
    }
    
    // 5. Устанавливаем округление при выводе до двух цифр после запятой
    cout << setprecision(2);
    
    // 6. Выводим содержимое массива в консоль
    for(int i = 0; i<N; i++)
    {
        cout << "ptrArray[" << i << "] = " << ptrArray[i] << endl;
    }
    
    // 7. Удаляем динамический массив, на который указывает ptrArray
    delete[] ptrArray;
    return 0;
}
```

Пример вывода:
```
ptrArray[0] = 0.75
ptrArray[1] = 1
ptrArray[2] = 3.5
ptrArray[3] = 0.78
ptrArray[4] = 1.8
ptrArray[5] = 1
ptrArray[6] = 1.7
ptrArray[7] = 0.2
ptrArray[8] = 0.9
ptrArray[9] = 0.4
```
