# Работа с функциями

1. Разработать алгоритм и написать программу, запрашивающую у пользователя два вещественных числа, вычисляющую и выводящую в консоль их среднее арифметическое. Ввод данных, вычисление и вывод реализовать в виде функций.

2. Разработать алгоритм и написать программу, запрашивающую у пользователя целое число N - размер динамического массива, создающую динамический массив вещественных чисел mas размером N и заполняющую массив mas индексами его элементов и выводящую его содержимое в консоль. Ввод данных, инициализацию массива и вывод данных реализовать в виде функций.

Пример вывода:
```
Input N: 10
0 1 2 3 4 5 6 7 8 9
```

Пример программной реализации:
```c++
#include <iostream>

using namespace std;

int inputGt0(string message, string errorMessage)
{
    while(1)
    {
        cout << message;
        int N;
        cin >> N;
        if(N>0) return N;
        cout << errorMessage << endl;
    }
}

double* createArray(int N)
{
    double* mas = new double[N];
    return mas;
}

void initArray(double* mas, int N)
{
    for(int i = 0; i < N; i++)
    {
        mas[i] = i;
    }
}

void printArray(double* arr, int N)
{
    for(int i = 0; i < N; i++)
    {
        cout << arr[i] << " ";
    }
    cout << endl;
}

int main()
{
    int N = inputGt0("Input N: ", "Error: N>0!");
    
    double* mas = createArray(N);
    initArray(mas, N);
    printArray(mas, N);

    return 0;
}
```

3. Разработать алгоритм и написать программу, запрашивающую у пользователя целое число N - размер динамического массива, создающую динамический массив вещественных чисел mas размером N и заполняющую массив mas случайными числами в диапазоне от -100 до 100 и выводящую его содержимое в консоль. Ввод данных, инициализацию массива и вывод данных реализовать в виде функций.

